//===================================================================
//
//2Dアクションゲーム制作(game.cpp)
//Author:大原隆俊
//
//===================================================================
//===================================================================
//インクルードファイル
//===================================================================
#include "game.h"
#include "input.h"
#include "main.h"
#include "bg.h"
#include "player.h"
#include "block.h"
#include "object.h"
#include "sound.h"
#include "time.h"
#include "fade.h"

//===================================================================
//ゲーム画面の初期化処理
//===================================================================
void InitGame(void)
{
	//ポリゴンの初期化設定
	InitPlayer();

	//ブロック初期化処理
	InitBlock();

	//オブジェクト初期化処理
	InitObject();

	//タイマー初期化
	InitTime();

	//タイマーセット
	SetTime(10);

	//背景初期化処理
	InitBG();

	//BGM
	PlaySound(SOUND_LABEL_bgm001);
}

//===================================================================
//ゲーム画面の終了処理
//===================================================================
void UninitGame(void)
{
	//BGM停止
	StopSound();

	//各種オブジェクトの終了処理
	UninitPlayer();

	//ブロック終了処理
	UninitBlock();

	//オブジェクト終了処理
	UninitObject();

	//タイマー終了処理
	UninitTime();

	//背景終了処理
	UninitBG();
}

//===================================================================
//ゲーム画面の更新処理
//===================================================================
void UpdateGame(void)
{
	//各種オブジェクトの更新処理
	UpdatePlayer();

	//ブロックの更新処理
	UpdateBlock();

	//オブジェクト更新処理
	UpdateObject();

	//タイマー更新処理
	UpdateTime();

	//背景更新処理
	UpdateBG();
}

//===================================================================
//ゲーム画面の描画処理
//===================================================================
void DrawGame(void)
{
	//背景描画処理
	DrawBG();

	//プレイヤーの描画処理
	DrawPlayer();

	//オブジェクトの描画処理
	DrawObject();

	//ブロック描画処理
	DrawBlock();

	//タイマー描画処理
	DrawTime();
}